tap "github/gh"
tap "homebrew/bundle"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "yakitrak/yakitrak"
brew "icu4c@76"
brew "awscli"
brew "bat"
brew "docker-compose"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "gcc"
brew "gh"
brew "glow"
brew "go", link: false
brew "go@1.24", link: true
brew "lazygit"
brew "localstack"
brew "make"
brew "neovim"
brew "nmap"
brew "node"
brew "pandoc"
brew "pipx"
brew "pkgconf"
brew "protoc-gen-go-grpc"
brew "python@3.12"
brew "ranger"
brew "repomix"
brew "ripgrep"
brew "ruby"
brew "rust"
brew "starship"
brew "stow"
brew "tldr"
brew "tmux"
brew "tree"
brew "websocat"
brew "yarn"
brew "yt-dlp"
brew "zoxide"
brew "qmk/qmk/qmk"
brew "yakitrak/yakitrak/obsidian-cli"
cask "adobe-acrobat-reader"
cask "alacritty"
cask "brave-browser"
cask "caffeine"
cask "calibre"
cask "claude-code"
cask "discord"
cask "docker-desktop"
cask "firefox"
cask "flux-app"
cask "font-hack-nerd-font"
cask "ghostty"
cask "gimp"
cask "google-chrome"
cask "iterm2"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "nordpass"
cask "nordvpn"
cask "notunes"
cask "obsidian"
cask "qbittorrent"
cask "raycast"
cask "rectangle"
cask "spotify"
cask "steam"
cask "visual-studio-code"
cask "vlc"
cask "wechat"
cask "whatsapp"
cask "zoom"
vscode "ahmadawais.shades-of-purple"
vscode "anthropic.claude-code"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "golang.go"
vscode "james-yu.latex-workshop"
vscode "kevinrose.vsc-python-indent"
vscode "mathematic.vscode-latex"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "openai.chatgpt"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "usernamehw.errorlens"
vscode "yzhang.markdown-all-in-one"
go "github.com/bufbuild/buf/cmd/buf"
go "github.com/go-delve/delve/cmd/dlv"
go "mvdan.cc/gofumpt"
go "golang.org/x/tools/cmd/goimports"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "golang.org/x/lint/golint"
go "golang.org/x/tools/gopls"
go "github.com/gotesttools/gotestfmt/v2/cmd/gotestfmt"
go "github.com/fullstorydev/grpcurl/cmd/grpcurl"
go "my-watch-later"
go "connectrpc.com/connect/cmd/protoc-gen-connect-go"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "honnef.co/go/tools/cmd/staticcheck"
