tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
brew "mas"
brew "bat"
brew "eza"
brew "fzf"
brew "gcc"
brew "gh"
brew "go"
brew "lazygit"
brew "make"
brew "neovim"
brew "protoc-gen-go-grpc"
brew "ripgrep"
brew "ruby"
brew "starship"
brew "stow"
brew "tldr"
brew "tmux"
brew "zoxide"
cask "adobe-acrobat-reader"
cask "alacritty"
cask "arc"
cask "calibre"
cask "flux"
cask "font-hack-nerd-font"
cask "iterm2"
cask "nordpass"
cask "nordvpn"
cask "notunes"
cask "rectangle"
cask "spotify"
cask "steam"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zoom"
vscode "ahmadawais.shades-of-purple"
vscode "golang.go"
vscode "kevinrose.vsc-python-indent"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "yzhang.markdown-all-in-one"
mas "Amphetamine", id: 937984704
mas "Xcode", id: 497799835
